In [ ]:
# https://www.youtube.com/watch?v=0YCvDUiCWms

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('F:\Dept\Machine Learning\Lectures\Week 3 Data Preprocessing\Data Preprocessing\EmpData1.csv')

In [3]:
df2 = pd.read_csv('F:\Dept\Machine Learning\Lectures\Week 3 Data Preprocessing\Data Preprocessing\EmpData2.csv')

In [5]:
display(df1,df2)

           Name  Age
0          Asad   23
1    Khadim Ali   25
2  Abdul Sattar   29
3    Rashid Ali   25
4        Sultan   27
5         Majid   28

         Name  Age
0        Raja   32
1  Khadim Ali   25
2       Babar   45
3  Rashid Ali   25
4       Qasim   57
5       Majid   28

In [8]:
dfIntersct = pd.merge(df1,df2)
# Merge works by default intersection

In [9]:
display(dfIntersct)

         Name  Age
0  Khadim Ali   25
1  Rashid Ali   25
2       Majid   28

In [11]:
dfUnion = pd.merge(df1,df2,how='outer')
# Applying union operation with the help of how

In [12]:
display(dfUnion)

           Name  Age
0          Asad   23
1    Khadim Ali   25
2  Abdul Sattar   29
3    Rashid Ali   25
4        Sultan   27
5         Majid   28
6          Raja   32
7         Babar   45
8         Qasim   57

In [14]:
df3 = pd.read_csv('F:\Dept\Machine Learning\Lectures\Week 3 Data Preprocessing\Data Preprocessing\EmpData3.csv')

In [16]:
joinEmp1_Emp3 =df1.join(df3)

In [17]:
display(joinEmp1_Emp3)

           Name  Age    Education   Salary
0          Asad   23          M.Sc  100000
1    Khadim Ali   25          B.Sc   75000
2  Abdul Sattar   29  Intermediate   50000
3    Rashid Ali   25        Matric   35000
4        Sultan   27           M.A   90000
5         Majid   28           B.A   76000